Revit 2027 API
BuiltInFailures.CurveFailures.TopLevelBelowBottomLevel Property
 For curveElem support multiple levels, top level belows curve bottom level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TopLevelBelowBottomLevel { get; }
Public Shared ReadOnly Property TopLevelBelowBottomLevel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TopLevelBelowBottomLevel {
	FailureDefinitionId^ get ();
}
static member TopLevelBelowBottomLevel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurveFailures Class
Autodesk.Revit.DB Namespace